docs: design docs update
